gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_sai.h
/* SAI synchronization mode definitions */
#define CFG0_SYNCMOD(regval)            (BITS(10,11)&((uint32_t)(regval) << 10U))
#define SAI_SYNCMODE_ASYNC              CFG0_SYNCMOD(0)                             /*!< asynchronous with the other sub-block */
#define SAI_SYNCMODE_OTHERBLOCK         CFG0_SYNCMOD(1)                             /*!< synchronous with the other sub-block */

/* SAI sampling clock edge */
#define SAI_SAMPEDGE_FALLING            ((uint32_t)0x00000000U)                     /*!< data sampled on SCK falling edge */
#define SAI_SAMPEDGE_RISING             SAI_CFG0_SAMPEDGE                           /*!< data sampled on SCK rising edge */

/* SAI Shift direction */
#define SAI_SHIFT_MSB                   ((uint32_t)0x00000000U)                     /*!< data is shifted with MSB first */
#define SAI_SHIFT_LSB                   SAI_CFG0_SHIFTDIR                           /*!< data is shifted with LSB first */

/* SAI data width definitions */
#define CFG0_DW(regval)                 (BITS(5,7)&((uint32_t)(regval) << 5U))
#define SAI_DATAWIDTH_8BIT              CFG0_DW(2)                                  /*!< SAI data width 8 bit */
#define SAI_DATAWIDTH_10BIT             CFG0_DW(3)                                  /*!< SAI data width 10 bit */
#define SAI_DATAWIDTH_16BIT             CFG0_DW(4)                                  /*!< SAI data width 16 bit */
#define SAI_DATAWIDTH_20BIT             CFG0_DW(5)                                  /*!< SAI data width 20 bit */
#define SAI_DATAWIDTH_24BIT             CFG0_DW(6)                                  /*!< SAI data width 24 bit */
#define SAI_DATAWIDTH_32BIT             CFG0_DW(7)                                  /*!< SAI data width 32 bit */

/* SAI protocol selection */
#define CFG0_PROTOCOL(regval)           (BITS(2,3)&((uint32_t)(regval) << 2U))
#define SAI_PROTOCOL_POLYMORPHIC        CFG0_PROTOCOL(0)                            /*!< polymorphic */
#define SAI_PROTOCOL_SPDIF              CFG0_PROTOCOL(1)                            /*!< SPDIF */
#define SAI_PROTOCOL_AC97               CFG0_PROTOCOL(2)                            /*!< AC97 */

/* SAI operating mode */
#define CFG0_OPERATING(regval)          (BITS(0,1)&((uint32_t)(regval) << 0U))
#define SAI_MASTER_TRANSMITTER          CFG0_OPERATING(0)                           /*!< master transmitter */
#define SAI_MASTER_RECEIVER             CFG0_OPERATING(1)                           /*!< master receiver */
#define SAI_SLAVE_TRANSMITTER           CFG0_OPERATING(2)                           /*!< slave transmitter */
#define SAI_SLAVE_RECEIVER              CFG0_OPERATING(3)                           /*!< slave receiver */

/* SAI compander mode */
#define CFG1_COMPANDER(regval)          (BITS(14,15)&((uint32_t)(regval) << 14U))
#define SAI_COMPANDER_OFF               CFG1_COMPANDER(0)                           /*!< no compansion applies */
#define SAI_COMPANDER_ULAW              CFG1_COMPANDER(2)                           /*!< u-law algorithm */
#define SAI_COMPANDER_ALAW              CFG1_COMPANDER(3)                           /*!< A-law algorithm */

/* SAI complement mode */
#define SAI_COMPLEMENT_1S               ((uint32_t)0x00000000U)                     /*!< data represented in 1's complement form */
#define SAI_COMPLEMENT_2S               SAI_CFG1_CPLMOD                             /*!< data represented in 2's complement form */

/* SAI mute value */
#define SAI_MUTESENT_0                  ((uint32_t)0x00000000U)                     /*!< 0 is sent via the serial data line when mute is on */
#define SAI_MUTESENT_LASTFREAM          SAI_CFG1_MTVAL                              /*!< if SLOTNB is less or equals to two, last frame is sent via the serial data line */

/* SAI mute on */
#define SAI_MUTE_OFF                    ((uint32_t)0x00000000U)                     /*!< mute mode off */
#define SAI_MUTE_ON                     SAI_CFG1_MT                                 /*!< mute mode on */

/* SAI serial data line output management */
#define SAI_SDLINE_DRIVE                ((uint32_t)0x00000000U)                     /*!< SD line output is driven entirely during the audio frame */
#define SAI_SDLINE_RELEASE              SAI_CFG1_SDOM                               /*!< SD line output is released near inactive slots */

/* SAI FIFO threshold */
#define CFG1_FFTH(regval)               (BITS(0,2)&((uint32_t)(regval) << 0U))
#define SAI_FIFOTH_EMPTY                CFG1_FFTH(0)                                /*!< FIFO threshold empty */
#define SAI_FIFOTH_QUARTER              CFG1_FFTH(1)                                /*!< FIFO threshold quarter full */
#define SAI_FIFOTH_HALF                 CFG1_FFTH(2)                                /*!< FIFO threshold half full */
#define SAI_FIFOTH_THREE_QUARTER        CFG1_FFTH(3)                                /*!< FIFO threshold three quarter full */
#define SAI_FIFOTH_FULL                 CFG1_FFTH(4)                                /*!< FIFO threshold full */

/* SAI frame synchronization offset */
#define SAI_FS_OFFSET_BEGINNING         ((uint32_t)0x00000000U)                     /*!< FS active edge asserted at the beginning of the first bit of the first slot */
#define SAI_FS_OFFSET_ONEBITBEFORE      SAI_FCFG_FSOST                              /*!< FS active edge asserted one bit cycle before normal FS when FSOST is 0 */

/* SAI frame synchronization active polarity */
#define SAI_FS_POLARITY_LOW             ((uint32_t)0x00000000U)                     /*!< FS low active polarity */
#define SAI_FS_POLARITY_HIGH             SAI_FCFG_FSPL                              /*!< FS high active polarity */

/* SAI frame synchronization function */
#define SAI_FS_FUNC_START               ((uint32_t)0x00000000U)                     /*!< FS only defines frame start */
#define SAI_FS_FUNC_START_CHANNEL        SAI_FCFG_FSFUNC                            /*!< FS define both frame start and channel number */

/* SAI slot active */
#define SAI_SLOT_ACTIVE_NONE            ((uint32_t)0x00000000U)                     /*!< all slot inactive */
#define SAI_SLOT_ACTIVE_0                BIT(16)                                    /*!< slot 0 active */
#define SAI_SLOT_ACTIVE_1                BIT(17)                                    /*!< slot 1 active */
#define SAI_SLOT_ACTIVE_2                BIT(18)                                    /*!< slot 2 active */
#define SAI_SLOT_ACTIVE_3                BIT(19)                                    /*!< slot 3 active */
#define SAI_SLOT_ACTIVE_4                BIT(20)                                    /*!< slot 4 active */
#define SAI_SLOT_ACTIVE_5                BIT(21)                                    /*!< slot 5 active */
#define SAI_SLOT_ACTIVE_6                BIT(22)                                    /*!< slot 6 active */
#define SAI_SLOT_ACTIVE_7                BIT(23)                                    /*!< slot 7 active */
#define SAI_SLOT_ACTIVE_8                BIT(24)                                    /*!< slot 8 active */
#define SAI_SLOT_ACTIVE_9                BIT(25)                                    /*!< slot 9 active */
#define SAI_SLOT_ACTIVE_10               BIT(26)                                    /*!< slot 10 active */
#define SAI_SLOT_ACTIVE_11               BIT(27)                                    /*!< slot 11 active */
#define SAI_SLOT_ACTIVE_12               BIT(28)                                    /*!< slot 12 active */
#define SAI_SLOT_ACTIVE_13               BIT(29)                                    /*!< slot 13 active */
#define SAI_SLOT_ACTIVE_14               BIT(30)                                    /*!< slot 14 active */
#define SAI_SLOT_ACTIVE_15               BIT(31)                                    /*!< slot 15 active */
#define SAI_SLOT_ACTIVE_ALL              BITS(16,31)                                /*!< slot all active */

/* SAI slot width definitions */
#define SCFG_SW(regval)                 (BITS(6,7)&((uint32_t)(regval) << 6U))
#define SAI_SLOT_WIDTH_DATA              SCFG_SW(0)                                 /*!< slot width equals data width */
#define SAI_SLOT_WIDTH_16BIT             SCFG_SW(1)                                 /*!< slot width of 16-bits */
#define SAI_SLOT_WIDTH_32BIT             SCFG_SW(2)                                 /*!< slot width of 32-bits */

